FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ЭМ_ПоказателиКумулятивнойМаржи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭМ_ПоказателиКумулятивнойМаржи</Name>
			<Comment>Показатели кумулятивной маржи</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ЭМ_ПоказателиКумулятивнойМаржи/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	// проверяем, заполнены ли ранее заполнены предопределенные элементы
	Если НЕ МаржаАвтомобиля.АвтоматическийРасчет
		И НЕ МаржаДопоборудования.АвтоматическийРасчет Тогда
		
		// МаржаАвтомобиля
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.МаржаАвтомобиля.ПолучитьОбъект();
		Если НЕ Объект.АвтоматическийРасчет Тогда
			Объект.АвтоматическийРасчет = Истина;
		КонецЕсли;
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// МаржаДопоборудования
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.МаржаДопоборудования.ПолучитьОбъект();
		Если НЕ Объект.АвтоматическийРасчет Тогда
			Объект.АвтоматическийРасчет = Истина;
		КонецЕсли;
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ВозмещениеРозница
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеРозница.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ВозмещениеFleet
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеFleet.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли;   
		
		// ДопБонус
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ДопБонус.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ВозмещениеТрейдИн
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеТрейдИн.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли;   
		
		// ВозмещениеОнлайнБронирование
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеОнлайнБронирование.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Возмещение Онлайн бронирование"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Возмещение Онлайн бронирование"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли;		
		
		// ВозмещениеКредит
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеКредит.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ВозмещениеДругое
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ВозмещениеДругое.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ВозмещениеДругое
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.БонусДистрибьютораМесячный.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// БонусДистрибьютораКвартальный
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.БонусДистрибьютораКвартальный.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// БонусДистрибьютораКвартальный
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.БонусДистрибьютораГодовой.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// БонусДистрибьютораКвартальный
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ПрогнозМаржаТрейдИн.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
		// ИноеВозмещение
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.ИноеВозмещение.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 

		// ИноеВозмещение
		Объект = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.РасходыНаЭквайринг.ПолучитьОбъект();
		Если НЕ Объект.ВключаетНДС Тогда
			Объект.ВключаетНДС = Истина;
		КонецЕсли;
		Если НЕ Объект.ЭтоРасход Тогда
			Объект.ЭтоРасход = Истина;
		КонецЕсли;
		Если Объект.Модифицированность() Тогда
			Попытка
				Объект.Записать();
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Обновлен элемент <"+СокрЛП(Объект)+">");
			Исключение
				Сообщить("Справочник ""Показатели кумулятивной маржи"". Ошибка записи элемента <"+СокрЛП(Объект)+">", СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
		
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
